# 桥墩 C40 核心区混凝土 
uniaxialMaterial Concrete02IS 1 3.25e10 -45.4e6 -0.0035 -30.8e6 -0.0108 0.1 3.0e6 3.25e9 
# 桥墩 C40 保护层混凝土（无约束） 
uniaxialMaterial Concrete02IS 5 3.25e10 -40e6 -0.002 -4e6 -0.006 0.1 3.0e6 3.25e9
# 桥墩与承台统一使用 HRB335 
uniaxialMaterial Steel02     2   335e6   2.0e11   0.01    18   0.925  0.15

# 求解迭代参数
set maxIters   100;
set tol   1.0e-8;
set numIntgrPts1  5;    # 桥墩 积分点


# ========== 双肢薄壁墩 单个墩肢 section 23 (y:1.6m, z:11.5m) ==========
# 局部 y (顺桥向/短边): -0.8 到 0.8
# 局部 z (横桥向/长边): -5.75 到 5.75
# 保护层厚度: 65mm
section Fiber 23 -GJ 1.94e11 {
    # --- 核心区混凝土（有约束，材料1）---
    # y: ±0.735m, z: ±5.685m（扣除65mm保护层）
    patch rect  1   20  80   -0.735  -5.685    0.735   5.685

    # --- 保护层混凝土（无约束，材料11）---
    patch rect  5  24   2   -0.8   -5.75     0.8   -5.685  ;# z轴负向底边
    patch rect  5  24   2   -0.8    5.685    0.8    5.75   ;# z轴正向顶边
    patch rect  5   2  80   -0.8   -5.685   -0.735  5.685  ;# y轴负向左边
    patch rect  5   2  80    0.735 -5.685    0.8    5.685  ;# y轴正向右边

  # 一号纵筋
    # z负端短边，两排
    layer straight 2 13 0.000804  -0.600 -5.685   0.600 -5.685
    layer straight 2 13 0.000804  -0.600 -5.600   0.600 -5.600

    # z正端短边，两排
    layer straight 2 13 0.000804  -0.600  5.600   0.600  5.600
    layer straight 2 13 0.000804  -0.600  5.685   0.600  5.685
    # 二号纵筋
    # y负侧长边
    layer straight 2 115 0.000804  -0.735 -5.685  -0.735  5.685
    layer straight 2 115 0.000804  -0.678 -5.685  -0.678  5.685
    layer straight 2 114 0.000804  -0.621 -5.685  -0.621  5.685

    # y正侧长边
    layer straight 2 115 0.000804   0.735 -5.685   0.735  5.685
    layer straight 2 115 0.000804   0.678 -5.685   0.678  5.685
    layer straight 2 114 0.000804   0.621 -5.685   0.621  5.685
}

# ========== 双肢薄壁墩 单个墩肢 section 24（与section 23完全相同）==========
section Fiber 24 -GJ 1.94e11 {
    patch rect  1   20  80   -0.735  -5.685    0.735   5.685
    patch rect  5  24   2   -0.8   -5.75     0.8   -5.685
    patch rect  5  24   2   -0.8    5.685    0.8    5.75
    patch rect  5   2  80   -0.8   -5.685   -0.735  5.685
    patch rect  5   2  80    0.735 -5.685    0.8    5.685
    
    # 一号纵筋
    # z负端短边，两排
    layer straight 2 13 0.000804  -0.600 -5.685   0.600 -5.685
    layer straight 2 13 0.000804  -0.600 -5.600   0.600 -5.600

    # z正端短边，两排
    layer straight 2 13 0.000804  -0.600  5.600   0.600  5.600
    layer straight 2 13 0.000804  -0.600  5.685   0.600  5.685
    # 二号纵筋
    # y负侧长边
    layer straight 2 115 0.000804  -0.735 -5.685  -0.735  5.685
    layer straight 2 115 0.000804  -0.678 -5.685  -0.678  5.685
    layer straight 2 114 0.000804  -0.621 -5.685  -0.621  5.685

    # y正侧长边
    layer straight 2 115 0.000804   0.735 -5.685   0.735  5.685
    layer straight 2 115 0.000804   0.678 -5.685   0.678  5.685
    layer straight 2 114 0.000804   0.621 -5.685   0.621  5.685
}
